app/Http/Controllers/ArticleController.php

select * from `cates`
---
    public function create()
    {
        $cates = Cate::all();

insert into `articles` (`title`, `user_id`, `cate_id`, `contents`, `updated_at`, `created_at`) values ('12345678', 2566, '5', '<article><p>&lt;script&gt;alert(\'你被勒索了\')&lt;/script&gt;</p></article>', '2020-11-08 06:24:26', '2020-11-08 06:24:26')
---
    public function store(ArticleRequest $request)
    {
        $article = new Article();
        $article->title = $request->title;
        $article->user_id = auth()->id();
        $article->cate_id = $request->cate_id;
        $article->contents = $request->contents;
        $article->save();