app/Http/Controllers/HomeController.php

    public function index()
    {
        $articles = Article::with(['cate','user'])->paginate(4);
---
select * from `cates` where `cates`.`id` in (1, 4, 14)
select * from `articles` where `articles`.`deleted_at` is null limit 4 offset 24
select * from `users` where `users`.`id` in (2566) and `users`.`deleted_at` is null
select count(*) as aggregate from `articles` where `articles`.`deleted_at` is null